workspace2/evidence/p5-c0/compiler/seeded/constant-typescript-lower.patch
--- a/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
+++ b/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
@@ -26,8 +26,5 @@
 impl CapabilityRow for TypeScriptCapabilities {
-    fn lower(_: &[u8]) -> Result<&[u8], FrontendError> {
-        Err(FrontendError::UnsupportedStage {
-            language: Language::TypeScriptSubset,
-            stage: Stage::LowerIr,
-        })
+    fn lower(source: &[u8]) -> Result<&[u8], FrontendError> {
+        Ok(source)
     }
 }
