workspace2/evidence/p5-c0/compiler/seeded/rust-lower-constant.patch
--- a/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
+++ b/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
@@ -22,1 +22,1 @@
-        Ok(source)
+        Ok(b"constant-rust-lower")
