workspace2/evidence/p5-c0/compiler/seeded/rust-parse-constant.patch
--- a/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
+++ b/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
@@ -39,1 +39,1 @@
-        source
+        b"constant-rust-parse"
