workspace2/evidence/p5-c0/compiler/seeded/typescript-parse-constant.patch
--- a/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
+++ b/workspace2/planes/compiler/crates/nudox-compile-registry/src/lib.rs
@@ -47,1 +47,1 @@
-        source
+        b"constant-typescript-parse"
